; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	thermograph0 - mode
	image1 - mode
	GroundStation8 - direction
	Star5 - direction
	Star1 - direction
	Star2 - direction
	Star4 - direction
	Star3 - direction
	Star6 - direction
	Star7 - direction
	Star0 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation8)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 GroundStation8)
	(supports instrument2 image1)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument3 thermograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 GroundStation8)
	(supports instrument4 image1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation8)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 Star2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet15)
	(supports instrument5 image1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 Star2)
	(calibration_target instrument5 Star6)
	(supports instrument6 thermograph0)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation8)
	(supports instrument7 image1)
	(calibration_target instrument7 Star1)
	(calibration_target instrument7 Star7)
	(calibration_target instrument7 Star5)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet9)
	(supports instrument8 image1)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 Star2)
	(supports instrument9 image1)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 Star4)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star7)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 Star6)
	(calibration_target instrument10 Star3)
	(supports instrument11 thermograph0)
	(supports instrument11 image1)
	(calibration_target instrument11 Star0)
	(calibration_target instrument11 Star7)
	(supports instrument12 thermograph0)
	(supports instrument12 image1)
	(calibration_target instrument12 Star0)
	(calibration_target instrument12 Star7)
	(calibration_target instrument12 Star6)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star7)
)
(:goal (and
	(pointing satellite0 GroundStation8)
	(pointing satellite1 Star7)
	(pointing satellite3 Planet15)
	(have_image Planet9 thermograph0)
	(have_image Phenomenon10 image1)
	(have_image Phenomenon11 thermograph0)
	(have_image Phenomenon12 thermograph0)
	(have_image Star13 image1)
	(have_image Planet14 thermograph0)
	(have_image Planet15 image1)
	(have_image Phenomenon16 thermograph0)
))

)

; plan
1. (turn_to satellite3 star2 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 star2)
   goals met: 0 of 11
2. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 0 of 11
3. (calibrate satellite3 instrument8 star2)
   added: (calibrated instrument8)
   goals met: 0 of 11
4. (turn_to satellite3 phenomenon16 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 phenomenon16)
   goals met: 0 of 11
5. (take_image satellite3 phenomenon16 instrument8 thermograph0)
   added: (have_image phenomenon16 thermograph0)
   goals met: 1 of 11
6. (turn_to satellite3 phenomenon12 phenomenon16)
   deleted: (pointing satellite3 phenomenon16)
   added: (pointing satellite3 phenomenon12)
   goals met: 1 of 11
7. (take_image satellite3 phenomenon12 instrument8 thermograph0)
   added: (have_image phenomenon12 thermograph0)
   goals met: 2 of 11
8. (turn_to satellite3 phenomenon11 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 phenomenon11)
   goals met: 2 of 11
9. (take_image satellite3 phenomenon11 instrument8 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 3 of 11
10. (turn_to satellite3 phenomenon10 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 phenomenon10)
   goals met: 3 of 11
11. (turn_to satellite0 groundstation8 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 groundstation8)
   goals met: 4 of 11
12. (take_image satellite3 phenomenon10 instrument8 image1)
   added: (have_image phenomenon10 image1)
   goals met: 5 of 11
13. (turn_to satellite1 star7 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star7)
   goals met: 6 of 11
14. (turn_to satellite3 planet14 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 planet14)
   goals met: 6 of 11
15. (take_image satellite3 planet14 instrument8 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 7 of 11
16. (turn_to satellite3 planet9 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 planet9)
   goals met: 7 of 11
17. (take_image satellite3 planet9 instrument8 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 8 of 11
18. (turn_to satellite3 star13 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 star13)
   goals met: 8 of 11
19. (take_image satellite3 star13 instrument8 image1)
   added: (have_image star13 image1)
   goals met: 9 of 11
20. (turn_to satellite3 planet15 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 planet15)
   goals met: 10 of 11
21. (take_image satellite3 planet15 instrument8 image1)
   added: (have_image planet15 image1)
   goals met: 11 of 11
